In [1]:
! pip install pandas

Requirement already satisfied: pandas in c:\users\bbuser\appdata\local\programs\python\python313\lib\site-packages (2.3.0)
Requirement already satisfied: numpy>=1.26.0 in c:\users\bbuser\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.3.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\bbuser\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\bbuser\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\bbuser\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\bbuser\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [4]:
import pandas as pd 

#To create a series from a list
my_list=[10,20,30,40]
s=pd.Series(my_list)
s

0    10
1    20
2    30
3    40
dtype: int64

In [5]:
labels = ['a','b','c','d']
s_labeld = pd.Series(data=my_list, index=labels)
s_labeld

a    10
b    20
c    30
d    40
dtype: int64

In [7]:
import numpy as np
arr=np.array([100,400,300])
s=pd.Series(arr)
s

0    100
1    400
2    300
dtype: int64

In [8]:
d={'a':10, 'b':20, 'c':30}
s_dict=pd.Series(d)
s_dict

a    10
b    20
c    30
dtype: int64

In [10]:
data={
    'Name':['Alice','Bob','Charlie','David'],
 'Age':[25,30,35,40],
 'City':['New York', 'London','Parise','Tokyo']
}
df=pd.DataFrame(data)
df

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35    Parise
3    David   40     Tokyo

In [12]:
data_list_of_dicts=[
    {'Name':'Eve','Age':28,'City':'Berlin'},
{'Name':'Frank','Age':32,'City':'Rome'}
]
df1=pd.DataFrame(data_list_of_dicts)
df1

    Name  Age    City
0    Eve   28  Berlin
1  Frank   32    Rome

In [17]:
np_array = np.array([[1,2,3],[4,5,6],[7,8,9]])
df_np = pd.DataFrame(np_array, columns = ["col_1","col_2","col_3"], index =["raw_1","raw_2","raw_3"])
df_np

       col_1  col_2  col_3
raw_1      1      2      3
raw_2      4      5      6
raw_3      7      8      9

In [23]:
df_np.col_2["raw_1":"raw_2"]

raw_1    2
raw_2    5
Name: col_2, dtype: int64

In [26]:
df_np[["col_1","col_2"]]

       col_1  col_2
raw_1      1      2
raw_2      4      5
raw_3      7      8

In [27]:
df.loc[0]

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [29]:
df.loc[0:3]

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35    Parise
3    David   40     Tokyo

In [33]:
df.loc[0:3,"Age"]
#loc take the location as a label

0    25
1    30
2    35
3    40
Name: Age, dtype: int64

In [32]:
df.iloc[0:3,1]

0    25
1    30
2    35
Name: Age, dtype: int64